In [2]:
import sqlite3

In [3]:
conn = sqlite3.connect('INSTRUCTOR.db')

In [4]:
# cursor object
cursor_obj = conn.cursor()

In [5]:
# Drop the table if already exists.
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [6]:
# Creating table
table = """ create table IF NOT EXISTS INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""
 
cursor_obj.execute(table)
 
print("Table is Ready")

Table is Ready

In [7]:
cursor_obj.execute('''insert into INSTRUCTOR values (1, 'Thando', 'Voyizana', 'East London', 'EC')''')
# cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Tee', 'Vee', 'East London', 'EC')''')

In [8]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Basi', 'Nqambi', 'Cape Town', 'WC'), (3, 'Xolie', 'Voyizana', 'Ermelo', 'MP')''')

In [9]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
  print(row_all)

All the data
(1, 'Thando', 'Voyizana', 'East London', 'EC')
(2, 'Basi', 'Nqambi', 'Cape Town', 'WC')
(3, 'Xolie', 'Voyizana', 'Ermelo', 'MP')

In [10]:
## Fetch few rows from the table
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
# If you want to fetch few rows from the table we use fetchmany(numberofrows) and mention the number how many rows you want to fetch
output_many = cursor_obj.fetchmany(2) 
for row_many in output_many:
  print(row_many)

All the data
(1, 'Thando', 'Voyizana', 'East London', 'EC')
(2, 'Basi', 'Nqambi', 'Cape Town', 'WC')

In [11]:
# Fetch only FNAME from the table
statement = '''SELECT FNAME FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
output_column = cursor_obj.fetchall()
for fetch in output_column:
  print(fetch)

All the data
('Thando',)
('Basi',)
('Xolie',)

In [12]:
query_update='''update INSTRUCTOR set CITY='Bizana' where FNAME="Thando"'''
cursor_obj.execute(query_update)

In [13]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
output1 = cursor_obj.fetchmany(2)
for row in output1:
  print(row)

All the data
(1, 'Thando', 'Voyizana', 'Bizana', 'EC')
(2, 'Basi', 'Nqambi', 'Cape Town', 'WC')

In [14]:
import pandas as pd
#retrieve the query results into a pandas dataframe
df = pd.read_sql_query("select * from instructor;", conn)

#print the dataframe
df

   ID   FNAME     LNAME       CITY CCODE
0   1  Thando  Voyizana     Bizana    EC
1   2    Basi    Nqambi  Cape Town    WC
2   3   Xolie  Voyizana     Ermelo    MP

In [15]:
#print just the LNAME for first row in the pandas data frame
df.LNAME[0]

'Voyizana'

In [16]:
df.shape

(3, 5)

In [17]:
# Close the connection
conn.close()